app/views/posts/index.html.erb

    <p>Posted by <%= post.user.name %></p>
    <p>Likes: <%= post.likes.count %></p>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]


    <% if current_user && !post.likes.any? { |like| like.user == current_user } %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]