app/controllers/comments_controller.rb

  def create
    @post = Post.find_by(id: params[:post_id])
    @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello post!"], ["post_id", 1], ["created_at", "2017-07-02 20:24:22.718081"], ["updated_at", "2017-07-02 20:24:22.718081"], ["user_id", 1]]