app/controllers/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2017-07-03 07:08:58.093006"], ["updated_at", "2017-07-03 07:08:58.093006"]]
---
  def create
    post = Post.find_by(id: params[:post_id])
    if current_user && !post.likes.any? { |like| like.user == current_user }
      like = post.likes.build
      like.user = current_user
      like.save