app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at", "picture", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["caption", "Hello world!"], ["created_at", "2017-07-02 17:02:01.436454"], ["updated_at", "2017-07-02 17:02:01.436454"], ["picture", "avatar.jpg"], ["user_id", 1]]
---
  def create
    current_user.posts.create(post_params)